// SPDX-License-Identifier: MIT OR Apache-2.0
//
// Copyright (c) 2018-2021 Andre Richter <andre.o.richter@gmail.com>

//! Rustランタイム初期化コード

use crate::{bsp, memory};

//--------------------------------------------------------------------------------------------------
// プライベートコード
//--------------------------------------------------------------------------------------------------

/// .bssセクションをゼロ詰め
///
/// # 安全性
///
/// - `kernel_init()`の前に呼び出されなければならない
#[inline(always)]
unsafe fn zero_bss() {
    memory::zero_volatile(bsp::memory::bss_range_inclusive());
}

//--------------------------------------------------------------------------------------------------
// パブリックコード
//--------------------------------------------------------------------------------------------------

/// C/C++における`crt0`や`c0`に相当する。`bss`セクションをクリアして
/// カーネル初期化コードにジャンプする。
///
/// # 安全性
///
/// - 1つのコアだけがアクティブで、この関数を実行しなければならない。
pub unsafe fn runtime_init() -> ! {
    zero_bss();

    crate::kernel_init()
}
